Shoopity/Matter_Notification_Device/generic_switch/sdkconfig.defaults
# CONFIG_IDF_TARGET="esp32c6"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

#enable BT
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

#disable BT connection reattempt
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n

#enable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=y

CONFIG_ENABLE_WIFI_AP=n

# This example uses 3 dynamic endpoints (root node + button state + LED indicator)
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=3

#enable lwIP route hooks
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=1500

# disable softap by default
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# Enable HKDF in mbedtls
CONFIG_MBEDTLS_HKDF_C=y

# Increase LwIP IPv6 address number to 6 (MAX_FABRIC + 1)
# unique local addresses for fabrics(MAX_FABRIC), a link local address(1)
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6

# disable groupcast cluster until verified
CONFIG_SUPPORT_GROUPCAST_CLUSTER=n

# enable USB serial JTAG
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Tell the chip to look at the factory partition for the discriminator
#CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=y
#CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER=y
